# Pandas

In [1]:
# 14-1
import pandas as pd

In [2]:
obj = pd.Series([5, -4, 7 ,0,12])
print(obj)

0     5
1    -4
2     7
3     0
4    12
dtype: int64

In [4]:
# 14-2
obj = pd.Series([8,-20,-3,13,2])
print(obj.values)
print(obj.index)
print(obj[2])

[  8 -20  -3  13   2]
RangeIndex(start=0, stop=5, step=1)
-3

In [5]:
s = pd.Series([9904321, 3448737, 2890541, 2466052], index=["서울", "부산", "인천", "대구"])

In [6]:
s

서울    9904321
부산    3448737
인천    2890541
대구    2466052
dtype: int64

In [7]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [8]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [9]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904321
부산    3448737
인천    2890541
대구    2466052
Name: 인구, dtype: int64

In [12]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2890541
Name: 인구, dtype: int64

In [13]:
s["부산":"대구"]

도시
부산    3448737
인천    2890541
대구    2466052
Name: 인구, dtype: int64

In [14]:
s0 = pd.Series(range(3), index=["a","b","c"])

In [15]:
s0

a    0
b    1
c    2
dtype: int64

In [16]:
s0.a

0

In [18]:
s0.b

1

In [19]:
s0.c

2

In [20]:
s.대구

2466052

In [21]:
s.서울

9904321

In [24]:
s2 = pd.Series({"서울" : 9631482, "부산":3393191, "인천":2632035, "대전":1490158}, index=["부산", "서울", "인천", "대전"])

In [25]:
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [26]:
ds = s - s2

In [27]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272839.0
인천    258506.0
dtype: float64

In [28]:
s.values - s2.values

array([ 6511130, -6182745,   258506,   975894], dtype=int64)

In [29]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [30]:
ds[ds.notnull()]

부산     55546.0
서울    272839.0
인천    258506.0
dtype: float64

In [32]:
rs = (s- s2)/ s2*100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832783
인천    9.821526
dtype: float64

In [33]:
rs["부산"] = 1.41

In [34]:
rs

부산    1.410000
서울    2.832783
인천    9.821526
dtype: float64

In [35]:
rs["대구"] = 1.51

In [36]:
rs

부산    1.410000
서울    2.832783
인천    9.821526
대구    1.510000
dtype: float64

In [37]:
del rs["서울"]

In [38]:
rs

부산    1.410000
인천    9.821526
대구    1.510000
dtype: float64

In [46]:
obj= pd.Series(range(10,60,10), index=['a','b','c','d','e'], name='data')

In [42]:
obj

a    10
b    20
c    30
d    40
e    50
Name: data, dtype: int64

In [47]:
# 14-4
print(obj*10)

a    100
b    200
c    300
d    400
e    500
Name: data, dtype: int64

In [49]:
print(obj[obj>25])

c    30
d    40
e    50
Name: data, dtype: int64

In [50]:
s

도시
서울    9904321
부산    3448737
인천    2890541
대구    2466052
Name: 인구, dtype: int64

In [51]:
for i, v in s.items():
    print(i, v)

서울 9904321
부산 3448737
인천 2890541
대구 2466052

In [52]:
for i in s:
    print(i)

9904321
3448737
2890541
2466052

In [54]:
for k in s.keys():
    print(k)

서울
부산
인천
대구

In [56]:
s2['대전']

1490158

In [58]:
pop = pd.Series({'서울':9765623, '부산':3441453, '대구':2461769}, index = ['서울', '부산', '대구', '대전', '광주'])

In [59]:
pop

서울    9765623.0
부산    3441453.0
대구    2461769.0
대전          NaN
광주          NaN
dtype: float64

In [60]:
pop['광주'] = 149336

In [61]:
pop

서울    9765623.0
부산    3441453.0
대구    2461769.0
대전          NaN
광주     149336.0
dtype: float64

In [62]:
pop[pop.notnull()]

서울    9765623.0
부산    3441453.0
대구    2461769.0
광주     149336.0
dtype: float64

In [64]:
pop.isna()

서울    False
부산    False
대구    False
대전     True
광주    False
dtype: bool

In [65]:
pop.fillna()

ValueError: Must specify a fill 'value' or 'method'.

In [68]:
data = {'이름':['홍지수', '안지영', '김성수','최예린'], '아이디':['jshong', 'jyahn','sukim','yrchoi'],'비밀번호':['1234','1234','1234','1234']}

frame = pd.DataFrame(data)
frame

    이름     아이디  비밀번호
0  홍지수  jshong  1234
1  안지영   jyahn  1234
2  김성수   sukim  1234
3  최예린  yrchoi  1234

In [97]:
member = {'Name' : ['Kim','Han'], 'Age' : [20,23], 'Phone':['010-3535-4576','010-1295-7899']}

frame = pd.DataFrame(member, columns=['Name', 'Phone', 'Age'], index=['01','02'])

frame

   Name          Phone  Age
01  Kim  010-3535-4576   20
02  Han  010-1295-7899   23

In [100]:
data = {'학교명':['가나고','다라고','알파고','렛잇고','자차고'], '학급수' : [25,23,15,19,10],'학생수':[620,600,550,580,400],'교사수':[80,95,70,90,65]}

frame = pd.DataFrame(data, index = ['01','02','03','04','05'])
frame

    학교명  학급수  학생수  교사수
01  가나고   25  620   80
02  다라고   23  600   95
03  알파고   15  550   70
04  렛잇고   19  580   90
05  자차고   10  400   65

In [101]:
frame.loc['02','학생수']

600

In [102]:
frame.loc['04',['학교명', '학급수', '교사수']]

학교명    렛잇고
학급수     19
교사수     90
Name: 04, dtype: object

In [103]:
# data[0][0]

In [104]:
data['학교명'][2]
# data[Columns][index]

'알파고'

In [114]:
frame.loc['04'][0]
# loc[index][columns]
# loc = location

'렛잇고'

In [116]:
frame.loc['04', ['학교명', '학급수', '교사수']]

학교명    렛잇고
학급수     19
교사수     90
Name: 04, dtype: object

In [91]:
frame.T

      01   02   03   04   05
학교명  가나고  다라고  알파고  렛잇고  자차고
학급수   25   23   15   19   10
학생수  620  600  550  580  400
교사수   80   95   70   90   65

In [117]:
data = {'아이디':['kim','song','han','choi'],
        '구매상품':['상품A','상품B','상품C','상품D'],
        '가격':[15000, 23000, 33000, 50000],
        '개수':[3, 5, 1, 10],
        '구매일':['0303', '0810', '0120', '0601']}

frame = pd.DataFrame(data)

frame

    아이디 구매상품     가격  개수   구매일
0   kim  상품A  15000   3  0303
1  song  상품B  23000   5  0810
2   han  상품C  33000   1  0120
3  choi  상품D  50000  10  0601

In [118]:
frame.iloc[2, 0]

'han'

In [119]:
frame.iloc[0,0]

'kim'

In [120]:
frame.iloc[3, :2]

아이디     choi
구매상품     상품D
Name: 3, dtype: object

In [121]:
frame.iloc[-1,::]

아이디      choi
구매상품      상품D
가격      50000
개수         10
구매일      0601
Name: 3, dtype: object

In [122]:
frame.iloc[:,[0,4]]

    아이디   구매일
0   kim  0303
1  song  0810
2   han  0120
3  choi  0601

In [176]:
scores = {'Name':['Kim', 'Ahn', 'Choi', 'Hwang', 'Park'],'Kor':[95,97,90,94,87],'Eng':[90,86,93,85,93],'Math':[85,88,89,88,99]}

socores = pd.DataFrame(scores, index=[1,2,3,4,5])
print(socores)
socores2 = socores.iloc[:,1:]
socores['Total'] = socores2.sum(axis=1)
socores['Avg'] = socores2.mean(axis=1).round(2)
socores

    Name  Kor  Eng  Math
1    Kim   95   90    85
2    Ahn   97   86    88
3   Choi   90   93    89
4  Hwang   94   85    88
5   Park   87   93    99

    Name  Kor  Eng  Math  Total    Avg
1    Kim   95   90    85    270  90.00
2    Ahn   97   86    88    271  90.33
3   Choi   90   93    89    272  90.67
4  Hwang   94   85    88    267  89.00
5   Park   87   93    99    279  93.00

In [177]:
socores[['Name','Total', 'Avg']]

    Name  Total    Avg
1    Kim    270  90.00
2    Ahn    271  90.33
3   Choi    272  90.67
4  Hwang    267  89.00
5   Park    279  93.00

In [181]:
print(socores['Name'].count())

5

In [182]:
print(len(socores))

5

In [183]:
socores.count()

Name     5
Kor      5
Eng      5
Math     5
Total    5
Avg      5
dtype: int64

In [204]:
socores.sort_values(by=['Total'], axis = 0, ascending = False)

# ascending = True : 오름차순, False : 내림차순
# by = 기준이 되는 곳 (Columns)

    Name  Kor  Eng  Math  Total    Avg
5   Park   87   93    99    279  93.00
3   Choi   90   93    89    272  90.67
2    Ahn   97   86    88    271  90.33
1    Kim   95   90    85    270  90.00
4  Hwang   94   85    88    267  89.00

In [214]:
socores.sort_values(by=['Kor'], ascending = False)

    Name  Kor  Eng  Math  Total    Avg
2    Ahn   97   86    88    271  90.33
1    Kim   95   90    85    270  90.00
4  Hwang   94   85    88    267  89.00
3   Choi   90   93    89    272  90.67
5   Park   87   93    99    279  93.00

In [205]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [216]:
df3.apply(lambda x: x.max()- x.min())

A    3
B    2
C    4
dtype: int64

In [222]:
df3.apply(lambda x: x.max() - x.min(), axis = 1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [230]:
df3.apply(pd.value_counts)
# 현 DF에선 Column 기준 각 숫자별 갯수를 표기한다.

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [231]:
df3.apply(pd.value_counts, axis=1)

     1    2    3    4    5
0  2.0  1.0  NaN  NaN  NaN
1  NaN  NaN  2.0  NaN  1.0
2  1.0  1.0  NaN  1.0  NaN
3  NaN  1.0  1.0  1.0  NaN
4  NaN  NaN  1.0  2.0  NaN

In [219]:
df3.apply(pd.value_counts).fillna(0).astype(int)
#NaN 으로 되어있는 데이터를 int 0으로 채운다(fillna, astype)
#astype = int, float ...

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [239]:
frame.categories()

AttributeError: 'DataFrame' object has no attribute 'categories'